[
    {
        "id": 1,
        "judul": "Libur Awal Puasa",
        "tanggal": "10 Mar 2026",
        "isi": "Diberitahukan kepada seluruh siswa bahwa libur awal puasa akan dimulai pada tanggal 12 Maret 2026. Kegiatan belajar mengajar akan aktif kembali pada tanggal 15 Maret 2026 with penyesuaian jadwal selama bulan Ramadan.",
        "kategori": "Umum"
    },
    {
        "id": 2,
        "judul": "Persiapan Ujian Tengah Semester",
        "tanggal": "05 Mar 2026",
        "isi": "Ujian Tengah Semester (UTS) akan dilaksanakan mulai tanggal 20 Maret 2026. Harap seluruh siswa mempersiapkan diri dengan baik dan melunasi administrasi sekolah sebelum tanggal tersebut.",
        "kategori": "Akademik"
    },
    {
        "id": 3,
        "judul": "Lomba Kebersihan Kelas",
        "tanggal": "01 Mar 2026",
        "isi": "Dalam rangka ulang tahun sekolah, akan diadakan lomba kebersihan kelas yang akan dinilai setiap hari Jumat selama bulan Maret. Kelas pemenang akan mendapatkan hadiah menarik.",
        "kategori": "Kesiswaan"
    },
    {
        "id": 4,
        "judul": "Jadwal Ekstrakurikuler Baru",
        "tanggal": "25 Feb 2026",
        "isi": "Terdapat perubahan jadwal untuk ekstrakurikuler Basket dan Futsal. Silakan cek mading sekolah atau hubungi pembina masing-masing untuk informasi lebih lanjut.",
        "kategori": "Ekstrakurikuler"
    },
    {
        "id": 5,
        "judul": "Upacara Peringatan Hari Pahlawan",
        "tanggal": "08 Nov 2025",
        "isi": "Dalam rangka memperingati Hari Pahlawan, sekolah akan mengadakan upacara bendera pada hari Senin, 10 November 2025. Seluruh siswa diwajibkan hadir mengenakan seragam lengkap dan tertib selama upacara berlangsung.",
        "kategori": "Umum"
    },
    {
        "id": 6,
        "judul": "Sosialisasi Bahaya Narkoba",
        "tanggal": "15 Nov 2025",
        "isi": "Akan diadakan seminar dan sosialisasi mengenai bahaya narkoba bagi remaja yang bekerja sama dengan BNN. Acara ini wajib diikuti oleh seluruh siswa kelas 10, 11, dan 12 di Aula Sekolah pada pukul 09.00 WIB.",
        "kategori": "Kesiswaan"
    }
]